"use client";

export default function WeddingInfo() {
  return (
    <section className="py-8">
      <h2 className="sr-only">예식 정보</h2>
      <div className="text-center space-y-6">
        <div className="flex justify-center">
          <svg xmlns="http://www.w3.org/2000/svg" width="126" height="16" fill="none"><g fill="currentColor" clip-path="url(#line-elements_svg__a)"><path d="M63.5 5.444c-.797-1.65-2.363-2.59-3.773-2.19-1.641.47-2.48 2.585-1.869 4.715.069.241.159.482.284.76.157.348 1.633 3.48 5.199 6.312l.159.125.158-.125c3.566-2.83 5.042-5.962 5.22-6.356q.162-.356.263-.716c.611-2.13-.227-4.244-1.87-4.712-1.412-.401-2.975.539-3.771 2.19zm5.153 2.384a5 5 0 0 1-.26.692c-.15.33-1.536 3.273-4.893 5.994-3.358-2.72-4.744-5.664-4.915-6.04a5 5 0 0 1-.239-.646c-.535-1.862.147-3.695 1.521-4.087q.264-.074.533-.073c1.159 0 2.346 1.013 2.86 2.532l.242.716.242-.716c.592-1.752 2.08-2.827 3.39-2.456 1.372.392 2.055 2.225 1.521 4.086zM54.965 13.77l.368-.352c-.04-.042-2.436-2.51-5.985-4.511l.004-.012c-.123-.056-.232-.116-.353-.172a22 22 0 0 0-1.232-.621C41.394 4.653 39.102.05 39.08 0l-.46.22c.021.045 1.786 3.604 6.494 6.852-1.706-.52-3.523-.808-5.385-.647-2.18.184-3.78.876-4.858 1.816a11 11 0 0 0-5.435-2.943C19.8 3.028 1.315 7.412.5 7.608l.118.494c.169-.04 13.878-3.295 23.853-2.903-8.631 1.058-18.78 7.329-22.478 10.414l.327.39C6.393 12.61 18.356 5.276 27.329 5.542c.701.022 1.364.114 1.995.25.41.098.81.202 1.185.322 1.623.55 2.961 1.45 3.999 2.478-.955.997-1.389 2.21-1.362 3.38.042 1.866 1.213 3.264 2.784 3.326.753.03 1.151-.336 1.348-.65.521-.83.32-2.331-.53-3.919a10.4 10.4 0 0 0-1.534-2.137c.971-.841 2.445-1.481 4.561-1.66 2.772-.234 5.455.538 7.781 1.632q.57.304 1.183.595c3.668 1.989 6.189 4.565 6.231 4.61zm-18.67-2.799c.75 1.406.966 2.745.547 3.411-.183.288-.488.428-.898.411-1.291-.05-2.256-1.24-2.294-2.83-.023-.992.325-2.095 1.192-3.016a10 10 0 0 1 1.45 2.027zM97.557 5.3a11 11 0 0 0-5.43 2.943c-1.079-.94-2.678-1.63-4.858-1.816-1.86-.16-3.675.125-5.379.642C86.594 3.824 88.36.265 88.38.22L87.92 0c-.023.05-2.31 4.644-8.67 8.087q-.674.315-1.305.66c-.101.049-.196.099-.3.148l.004.01c-3.55 2-5.945 4.469-5.985 4.511l.367.352c.043-.045 2.623-2.676 6.357-4.672.344-.165.685-.333 1.007-.508 2.339-1.105 5.038-1.892 7.829-1.658 2.116.18 3.59.822 4.561 1.66a10.6 10.6 0 0 0-1.533 2.138c-.848 1.587-1.052 3.09-.53 3.919.196.311.58.678 1.348.65 1.568-.062 2.739-1.46 2.781-3.327.026-1.169-.407-2.383-1.362-3.38a10.5 10.5 0 0 1 4-2.477c.374-.12.772-.225 1.182-.321.63-.137 1.293-.23 1.997-.25 8.99-.263 20.936 7.064 25.009 10.458l.327-.39c-3.699-3.082-13.821-9.358-22.457-10.414 9.975-.387 23.661 2.863 23.829 2.903l.118-.493c-.815-.196-19.303-4.583-28.942-2.308zm-4.21 6.661c-.038 1.59-1.003 2.78-2.294 2.83-.42.014-.716-.123-.898-.411-.42-.666-.204-2.003.547-3.411a10 10 0 0 1 1.45-2.027c.87.924 1.216 2.027 1.192 3.017z"></path></g><defs><clipPath id="line-elements_svg__a"><path fill="#fff" d="M.5 0h126v16H.5z"></path></clipPath></defs></svg>
        </div>
          <div className="font-caramel text-xl leading-4 font-normal text-thema-04-point mb-2 italic">Invitation</div>
          <div className="space-y-6 font-sans text-[#555] text-sm leading-loose text-center">
            <p className="text-xs">
              “너는 나에게 세상에서 단 하나뿐인 존재가 될 거야<br />
              나도 너에게 세상에서 단 하나뿐인 존재가 되겠지”<br />
              – 생텍쥐페리 〈어린왕자〉 중
            </p>
          </div>

          <div className="space-y-6 font-sans text-[#555] text-sm leading-loose text-center">
            <p>
            우주선에서 처음 만난 우리,<br />
            세상에서 제일 귀여운<br />
            할머니 할아버지가 될 때까지<br />
            웃으며 사랑하며 살겠습니다<br />
            <br />
            따뜻한 봄날,<br />
            저희의 시작을 함께해 주셔서 감사합니다<br />
            <br />
            </p>
            <div className="flex items-center justify-center gap-4">
              <p className="text-base">이재근<span className="px-1">•</span>손영자</p><p className="min-w-[21px] text-center text-sm">차남</p><p className="text-base">이승준</p>
            </div>
            <div className="flex items-center justify-center gap-4">
              <p className="text-base">김현중<span className="px-1">•</span>김은경</p><p className="min-w-[21px] text-center text-sm">장녀</p><p className="text-base">김인혜</p>
            </div>
          </div>
          

        {/* <div className="font-serif text-3xl text-[#333] tracking-wide">
          <span className="font-medium">이승준</span>
          <span className="mx-3">&</span>
          <span className="font-medium">김인혜</span>
        </div>
        <p className="font-sans text-[#555] text-sm leading-relaxed">
          2025년 05월 20일 (화) 오후 2시
        </p>
        <p className="font-sans text-[#555] text-sm leading-relaxed">
          더모멘트 컨벤션 3층 그랜드볼룸
        </p>
        <p className="font-sans text-[#333] text-xs leading-relaxed">
          서울시 강남구 테헤란로 123
        </p>*/}
      </div> 
    </section>
  );
}
